import { getDataStorage } from "./localStorage.js";

export const setting = {
    start: false,
    score: 0,
    speed: 3,
    traffic: 3, //задает сложность игры  расстояние между машинками 2,5 машини
    record: getDataStorage('score'),
  };

  export const music = new Audio('../../../../music/muzyka-dlya-igr-15.mp3');

  export const weatherIcon = {
    cloud:`<ion-icon name="cloud-outline"></ion-icon>`,
    rainy:`<ion-icon name="rainy-outline"></ion-icon>`,
    thunderstorm:`<ion-icon name="thunderstorm-outline"></ion-icon>`, //гроза
    partlySunny: `<ion-icon name="partly-sunny-outline"></ion-icon>`,
    sun:`<ion-icon name="sunny-outline"></ion-icon>`,
  }

export const db = [
  {name:'Бандеровен',
    nickName:'Овен',
    discription:'Овни - стихія полумʼя. По життю в них теж все палає. Не знають страху, відмови, поразки. Якщо щось задумали - хрін перепреш.',
    textDescrib:' Якщо Овен неправий, він правий. Якщо ви не погоджуєтеся з Овном,  погодитесь. Якщо хочете додати пікантності в своє життя - просто скажіть Овну, як йому жити. “Останнє слово завжди за нами”',
    gun:'Протитанкові ракетні комплекси Javelin',
    advaic:'Знайти час на себе',
    number:'4, 7, 9, 11'
  },
  {name:'Бандерець',
    nickName:'Телець',
    discription:'Тельці - рогаті небожителі. Перш ніж прийняти рішення, Телець обдумає все разів зо триста.  А потім все одно буде лише на 25% впевненим, що діє правильно. ',
    textDescrib:' Стабільність, порядок, дисципліна для них - база. Якщо ви запрошуєте Тельця на побачення і не кажете куди, +- до 19:00 він зійде з розуму. “Мої принципи непохитні”',
    gun:'Бронеавтомобіль AMX-10RC',
    advaic:'Подорожі та великі покупки',
    number:'1, 5, 14, 30'
  },
  {name:'Бандерюки',
    nickName:'Близнюки',
    discription:'Близнюки - авантюристи в стилі “пан або пропав”. Відпочинок - це пробігти 10 км,  попорати худобу і зробити якусь диверсію на расєї. ',
    textDescrib:'Оптимісти, рішучі та впевнені в собі, завжди знайдуть пригоди на свою 5-ту точку. Настрій приблизно як березень:  сніг, дощ, град, сонце, цунамі.“Хто не ризикує, той не ми, бо ми завжди пʼємо шампанське”. ',
    gun:'Багатоцільовий БТР Bastion',
    advaic:'Насолоджуватися життям тут і зараз',
    number:'5, 16, 23, 31'
  },
  {name:'Бандерак',
    nickName:'Рак',
    discription:'Раки - найчуттєвіші та найбільш емоційні люди, але вперті, тому ніколи з цим не погодяться.',
    textDescrib:'Drama Queen усіх знаків зодіаку. Але третє око Раків має найгострішу інтуїцію. Завдяки їхньому покерфейсу, ви ніколи не здогадаєтеся, що у них в голові: чи то поле з метеликами, чи то план нападу по чотирьох позиціях. “Маєте критику? Залиште її при собі”',
    gun:'Реактивні системи залпового вогню',
    advaic:'Подорожі та втілення в життя нових ідей',
    number:'3, 12, 25, 30'
  },
  {name:'Бандеролев',
    nickName:'Лев',
    discription:'Леви - найбільш яскраві та харизматичні особистості. Справжні королі, завжди досягають свого, щедрі, великодушні, але тільки з обраними.', 
    textDescrib:'Якщо б за гордість давали премію, статуетка була б у формі лева. Леви люблять жартувати над собою, але вам над ними жартувати не радимо. “Є тільки дві точки зору - моя та хибна”',
    gun:'Танки Leopard',
    advaic:'Карʼєрне зростання та родинне полумʼя',
    number:'2, 14, 26, 29'
  },
  {name:'Бандеродіва',
    nickName:'Діва',
    discription:'Діви - фанатичні перфекціоністи, які повільно, але впевнено досягають мети.  ',
    textDescrib:'Коли Діви прасують одяг, то прасують і шкарпетки, і панчохи, і шнурки від найків. Якщо, не приведи боже, ви дасте Діві чорну ручку із зеленим ковпачком, отримає панічну атаку. “Я що, багато прошу? Просто веди себе ідеально 24/7!”',
    gun:'Зенітні самохідні установки Gepard',
    advaic:'Час налагоджувати стосунки',
    number:'5, 13, 28, 29'
  },      
  {name:'Бандерези',
    nickName:'Терези',
    discription:'Терези - з дитинства мають якийсь особливий шарм та привабливість, за що їх неможливо не любити. ',
    textDescrib:'Живуть у темпі “5 пʼятниць на тиждень”. 5 настроїв на хвилину. 5 особистостей на день. Ніколи не знаєш, чого чекати від Терезів. Будь-яке рішення приймається 2-3 тижні. А потім ще 20 разів перевіряється.“Сам не сплю і вам не дам”           ',
    gun:'Безпілотні повітряні системи Ghost',
    advaic:'Прибавка до зарплати та гармонія',
    number:'3, 12, 24, 31'
  },      
  {name:'Бандерпіон',
    nickName:'Скорпіон',
    discription:'Скорпіони - незалежні, самостійні, сталеві особистості, але з чуйною душею і добрим серцем, які ви ніколи не побачите. ',
    textDescrib:'Дуже складна і глибока натура. Якщо Скорпіон обрав вас у друзі/партнери, то можете почуватися як “Оскар” на поличці у ДіКапріо. Якщо ваша думка йде всупереч їхній, то ви її зміните. “Я не злопамʼятний, але все памʼятаю”',
    gun:'Ракетні установки HIMARS',
    advaic:'Проявіть творчу натуру',
    number:'6, 9, 27, 28'
  },                                 
  {name:'Бандерілець',
    nickName:'Стрілець',
    discription:'Стрільці - найбільш енергійні та позитивні особистості, у яких хочеться знайти кнопку “Викл”, але її немає.  ',
    textDescrib:'Життя в ритмі “щось робити, кудись їхати”. Будь-яку ситуацію можуть обернути на свою користь та на хвилю оптимізму. Вкрали гроші - можливість заробити нові. Розбив келих - на щастя. “Не будь як всі, будь original”',
    gun:'Бойова машина піхоти Bradley',
    advaic:'Досить вирішувати чужі проблеми',
    number:'7, 17, 27, 30'
  },
  {name:'Бандероріг',
    nickName:'Козоріг',
    discription:'Козероги - цілеспрямовані, сильні особистості, які досягають цілей так легко, наче лускають насіннячко. ',
    textDescrib:'Якщо ви плануєте подорож із Козерогами, будьте готовими до детального аналізу кожного кроку, після якого перехочеться їхати. Думки в голові рухаються зі швидкістю машин у Форсажі.“Сльози у Козерогів - це 8-е диво світу”',
    gun:'САУ Paladin зі 155-мм гарматою',
    advaic:'Будьте готовими до змін',
    number:'2, 6, 13, 27'
  }, 
  {name:'Бандеролій',
    nickName:'Водолій',
    discription:'Водолії - особистості з найбільшим серцем та душею, але якщо хочете їх обдурити, це буде ваша остання ідея в житті. ',
    textDescrib:'У Водоліїв чудово розвинена інтуіція та вміння бачити людей. Ви тільки ввійшли, а вони вже знають, які у вас дитячі травми і що ви за людина. “Не май сто друзів, а май одного Водолія”',
    gun:'Системи протиповітряної оборони С-300',
    advaic:'Нові можливості та допомога',
    number:'6, 11, 15, 29'
  }, 
  {name:'Бандериби',
    nickName:'Риби',
    discription:'Риби - це ті самі люди, до яких ви приходите ввечері з пляшечкою вина і душевними ранами.  ',
    textDescrib:'Гнучкі особистості, які найшвидше адаптуються до будь-яких змін. Треба переїхати? Піду спакую валізку. Треба вночі виїхати на допомогу другу? Піду візьму лопату. Відчуття справедливості гостріше за самурайський меч. “У вир з головою”',
    gun:'Протитанкові комплекси NLAW',
    advaic:'Подорожі та зміни в житті',
    number:'1, 13, 27, 31 '
  }
]  

export const db_result = [ 
'Абсолютно несумісні. Зірочки кажуть, що стосунки приреченні, адже ви надто різні. Але, можливо, ви як той інь-янь:  хоч і зовсім різні, але одне без одного ніяк? Тут уже залежить від вас, тож маєте почуття - спробуйте',
'Погана сумісність Ми любимо американські гірки - девіз ваших стосунків.Ваш шлях у стосунках, якщо і буде, то м’яко кажучи, тернистим. Але якщо є почуття, коли це когось зупиняло?',
'Нейтральна сумісність. Або пан, або пропав. Для таких стосунків головне пройти перевірку часом. Ви як оливки: почнете любити одне одного, тільки коли обидва подорослішаєте',
'Хороша сумісність.Такі стосунки завжди починаються з фрази: “Божеее, яке кончене”, коли вас бісить в людині все, але тягне одне до одного, наче магнітом. І в голові каша. Але далі одне без одного вже неможливо',
'Ідеальна сумісність. Тут рівень Love Is - обійнявшись, дивитись, як палають куполи кремля. Зазвичай такі стосунки починаються з довгої френдзони, а в один момент переростають у найміцніше кохання і родину'
 ]   
 
 export const tableSumisnisty=[
[3,2,4,2,5,1,3,2,5,2,4,1],
[2,3,1,4,1,5,2,3,4,5,1,4],
[4,1,3,2,4,1,5,2,3,4,5,1],
[1,4,2,3,1,4,4,5,2,3,1,5],
[5,1,4,1,3,2,4,4,5,2,3,1],
[1,5,1,4,2,3,2,4,4,5,2,3],
[3,2,5,1,4,1,3,2,4,5,2,5],
[2,3,2,5,2,4,2,3,1,4,1,5],
[5,2,3,1,5,1,4,1,3,1,4,1],
[2,5,1,3,1,5,2,4,1,3,1,4],
[4,1,5,1,3,2,5,1,4,1,1,1],
[2,4,1,5,1,3,2,5,1,4,1,3]
]
  

export const colors = {
  blue: {
    50: {
      value: "#e3f2fd"
    },
    100: {
      value: "#bbdefb"
    }
  },
  green: {
    50: {
      value: "#e8f5e9"
    },
    100: {
      value: "#c8e6c9"
    }
  },
  purple: {
    50: {
      value: "#f3e5f5"
    },
    100: {
      value: "#e1bee7"
    }
  },
  orange: {
    50: {
      value: "#ffe0b2"
    },
    100: {
      value: "#ffe0b2"
    }
  },
  red: {
    50: {
      value: "#ffebee"
    },
    100: {
      value: "#ffcdd2"
    }
  }
};